import { FC, useState } from 'react';

import style from './Info.module.scss';

const Info: FC = () => {
    const [isHiden, setIsHiden] = useState(true);

    const closedInfo = () => {
        setIsHiden(false)
    }

    return (
        <section className={`${style.info} ${isHiden ? '' : style['isHiden']}`}>
            <div className={style.offer}>
                <h1 className={style.title}>Передбаченння як це працює</h1>
                <p className={style.description}>
                    На нашому сайті з передбаченнями, ми пропонуємо унікальну можливість отримати особисте передбачення на кожен день. Кожне число, яке вам випадає, має своє власне значення і повідомляє про певні аспекти вашого життя.
                    <br />
                    <br />
                    Наші передбачення базуються на давніх традиціях і вивченні чисел, символів та їх впливу на людську долю. Вони враховують вплив числа на вашу енергію, настрій та події, які можуть статися у вашому житті.
                    <br />
                    <br />
                    Ми віримо, що числа мають особливу силу і можуть надати вам цінні вказівки та рекомендації для вашого майбутнього. Вони можуть допомогти вам краще розуміти себе, зосередитися на потрібних аспектах вашого життя і прийняти правильні рішення.
                    <br />
                    <br />
                    Засновані на аналізі чисел і їх символіки, наші передбачення допомагають розкрити потенціал кожного дня. Вони можуть надати вам впевненість, інтуїтивність та направленість для досягнення ваших цілей.
                    <br />
                    <br />
                    Нехай наші передбачення стануть вам надійними порадниками у повсякденному житті, допоможуть розширити свій світогляд і відкрити нові можливості. Вірте у себе і в силу чисел, і незабаром ви побачите, як ваше життя стає яскравішим та насиченішим.
                </p>
            </div>
            <button onClick={closedInfo}>&#10007;</button>
        </section>
    );
}

export default Info;
